In [1]:
# Load the pandas package
import pandas as pd

In [2]:
# Load the country.csv data
country = pd.read_csv('country.csv')

In [3]:
# Display the country dataframe
country

               Name Continent  Population
0       Afghanistan      Asia    22720000
1           Albania    Europe     3401200
2           Algeria    Africa    31471000
3    American Samoa   Oceania       68000
4           Andorra    Europe       78000
..              ...       ...         ...
234  Western Sahara    Africa      293000
235           Yemen      Asia    18112000
236      Yugoslavia    Europe    10640000
237          Zambia    Africa     9169000
238        Zimbabwe    Africa    11669000

[239 rows x 3 columns]

In [4]:
# Select rows where the Continent is South America
country[country['Continent'] == 'South America']

                 Name      Continent  Population
9           Argentina  South America    37032000
25            Bolivia  South America     8329000
29             Brazil  South America   170115000
43              Chile  South America    15211000
47           Colombia  South America    42321000
62            Ecuador  South America    12646000
69   Falkland Islands  South America        2000
74      French Guiana  South America      181000
91             Guyana  South America      861000
166          Paraguay  South America     5496000
167              Peru  South America    25662000
201          Suriname  South America      417000
226           Uruguay  South America     3337000
229         Venezuela  South America    24170000

In [5]:
# Select rows where the Continent is not Asia
country[country['Continent'] != 'Asia']

                  Name Continent  Population
1              Albania    Europe     3401200
2              Algeria    Africa    31471000
3       American Samoa   Oceania       68000
4              Andorra    Europe       78000
5               Angola    Africa    12878000
..                 ...       ...         ...
233  Wallis and Futuna   Oceania       15000
234     Western Sahara    Africa      293000
236         Yugoslavia    Europe    10640000
237             Zambia    Africa     9169000
238           Zimbabwe    Africa    11669000

[188 rows x 3 columns]

In [6]:
# Select rows where the Continent is Asia or Europe
country[(country['Continent'] == 'Asia') | (country['Continent'] == 'Europe')]

               Name Continent  Population
0       Afghanistan      Asia    22720000
1           Albania    Europe     3401200
4           Andorra    Europe       78000
10          Armenia      Asia     3520000
13          Austria    Europe     8091800
..              ...       ...         ...
223  United Kingdom    Europe    59623400
227      Uzbekistan      Asia    24318000
230         Vietnam      Asia    79832000
235           Yemen      Asia    18112000
236      Yugoslavia    Europe    10640000

[97 rows x 3 columns]

In [7]:
# Select rows where the Continent is not in Asia
country[~(country['Continent'] == 'Asia')]

                  Name Continent  Population
1              Albania    Europe     3401200
2              Algeria    Africa    31471000
3       American Samoa   Oceania       68000
4              Andorra    Europe       78000
5               Angola    Africa    12878000
..                 ...       ...         ...
233  Wallis and Futuna   Oceania       15000
234     Western Sahara    Africa      293000
236         Yugoslavia    Europe    10640000
237             Zambia    Africa     9169000
238           Zimbabwe    Africa    11669000

[188 rows x 3 columns]